app/controllers/characters_controller.rb

SELECT  "c_classes".* FROM "c_classes" WHERE "id"."class_id" = '1' LIMIT 1
SELECT "races".* FROM "races"
SELECT  "c_classes".* FROM "c_classes" WHERE "c_classes"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "races".* FROM "races" WHERE "races"."id" = $1 LIMIT 1  [["id", 0]]
---
	def preview

		#m f and n only affect names and are not printed on the sheet
		@m = params[:m]
		@f = params[:f]
		@n = params[:n]
		binding.pry
		charobj = CharactersController.CharTemp.new
		params[:lvl] == "" ? level = rand(1..20) : level = params[:lvl].to_i
		charobj.set_race(@race)
		random?(params[:c_class][:class_id]) ? charobj.set_cclass(random(1..CClass.all.count)) : charobj.set_cclass(params[:c_class][:class_id].to_i)
		charobj.set_level(1)
		CClassesController.generate_abilities(charobj)
		while charobj.get_level < level
			CClassesController.level_up(charobj)
		end
		charobj.set_quirks(Appearance.generate)
		binding.pry
		modify_by_race
				#getting params from form entries
		race_id_temp = params[:race][:race_id].to_i
		random?(race_id_temp) ? @race = Race.all.sample : @race = Race.find_by_id(race_id_temp)

SELECT  "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT 1  [["id", 24]]
---
	def view
		#save the form result into the cookie as character data
		session[:character] = params[:npc]

		#finds character in the database
		@npc = Character.find_by_id(session[:character])

SELECT  "spells".* FROM "spells" WHERE "spells"."id" = $1 LIMIT 1  [["id", 15]]
---
				slist = @npc.spells_list.split(',')
				@spells_list = Array.new
				slist.each do |spell|
					add = Spell.find_by_id(spell)